Revit 2024 API
PrintParameters.UserDefinedMarginY Property
 The User defined Y value of offset from left bottom corner. Unit is inch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete. Use OriginOffsetY instead.")]
public double UserDefinedMarginY { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete. Use OriginOffsetY instead.")> _
Public Property UserDefinedMarginY As Double
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete. Use OriginOffsetY instead.")]
public:
property double UserDefinedMarginY {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown if PaperPlacement is not Margins and MarginType is not User defined type.
See Also
PrintParameters Class
Autodesk.Revit.DB Namespace